
## Terraform plan for environment: `dev`

**Commit:** ad10db0a1bfa32003865bc9ed9f50438842d32b5


**API version:** 988f85a
**Selfserve version:** 988f85a
**Internal version:** 988f85a

### Plan summary

`1 to add, 2 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_job_definition.this["process-queue"]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["process-queue"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "queue:process-queue",
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:latest"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "process-queue"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "process-queue"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be updated in-place
  ~ resource "aws_batch_job_queue" "this" {
        id                    = "arn:aws:batch:eu-west-1:054614622558:job-queue/BatchTestHighPriorityFargate"
        name                  = "BatchTestHighPriorityFargate"
      + tags                  = {}
        # (6 unchanged attributes hidden)
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be updated in-place
  ~ resource "aws_batch_job_queue" "this" {
        id                    = "arn:aws:batch:eu-west-1:054614622558:job-queue/BatchTestLowPriorityFargate"
        name                  = "BatchTestLowPriorityFargate"
      + tags                  = {}
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

</details>